def area(a, b):
    '''
    Вычисляет площадь прямоугольника по заданным длине и ширине.

    Параметры:
        a (float): Длина прямоугольника.
        b (float): Ширина прямоугольника.

    Возвращаемое значение:
        float: Площадь прямоугольника.
    '''
    return a * b

def perimeter(a, b):
    '''
    Вычисляет периметр прямоугольника по заданным длине и ширине.

    Параметры:
        a (float): Длина прямоугольника.
        b (float): Ширина прямоугольника.

    Возвращаемое значение:
        float: Периметр прямоугольника.
    '''
    return 2 * (a + b)
